// здесь будет массив кодов символов для вывода на 7-ми сегментные индикаторы
// чтобы не загромождать основной скетч

#ifndef LibCharIndicator_h
#define LibCharIndicator_h
#include <Arduino.h>


byte indCharLib[] = { B11111010,      // цифра 0
                      B10000010,      // цифра 1
                      B10111001,      // цифра 2
                      B10101011,      // цифра 3
                      B11000011,      // цифра 4
                      B01101011,      // цифра 5
                      B01111011,      // цифра 6
                      B10100010,      // цифра 7
                      B11111011,      // цифра 8
                      B11101011,      // цифра 9
                      
                      B01101011,      //10 символ S
                      B01111001,      //11 символ E
                      B01011001,      //12 символ t
                      B00000100,      //13 символ точки
                      B00010001,      //14 символ r
  
};






#endif
